/* automatically generated by rust-bindgen 0.71.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 39;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const pdFREERTOS_ERRNO_EINPROGRESS: u32 = 119;
pub const pdFREERTOS_ERRNO_EALREADY: u32 = 120;
pub const pdFREERTOS_ERRNO_EADDRNOTAVAIL: u32 = 125;
pub const pdFREERTOS_ERRNO_EISCONN: u32 = 127;
pub const pdFREERTOS_ERRNO_ENOTCONN: u32 = 128;
pub const pdFREERTOS_ERRNO_ENOMEDIUM: u32 = 135;
pub const pdFREERTOS_ERRNO_EILSEQ: u32 = 138;
pub const pdFREERTOS_ERRNO_ECANCELED: u32 = 140;
pub const pdFREERTOS_LITTLE_ENDIAN: u32 = 0;
pub const pdFREERTOS_BIG_ENDIAN: u32 = 1;
pub const pdLITTLE_ENDIAN: u32 = 0;
pub const pdBIG_ENDIAN: u32 = 1;
pub const portTICK_TYPE_IS_ATOMIC: u32 = 1;
pub const portSTACK_GROWTH: i32 = -1;
pub const portBYTE_ALIGNMENT: u32 = 16;
pub const portPRIORITY_SHIFT: u32 = 4;
pub const portMAX_BINARY_POINT_VALUE: u32 = 3;
pub const portICCPMR_PRIORITY_MASK_OFFSET: u32 = 4;
pub const portICCIAR_INTERRUPT_ACKNOWLEDGE_OFFSET: u32 = 12;
pub const portICCEOIR_END_OF_INTERRUPT_OFFSET: u32 = 16;
pub const portICCBPR_BINARY_POINT_OFFSET: u32 = 8;
pub const portICCRPR_RUNNING_PRIORITY_OFFSET: u32 = 20;
pub const portBYTE_ALIGNMENT_MASK: u32 = 15;
pub const portUSING_MPU_WRAPPERS: u32 = 0;
pub const portNUM_CONFIGURABLE_REGIONS: u32 = 1;
pub const portHAS_STACK_OVERFLOW_CHECKING: u32 = 0;
pub const configUSE_PICOLIBC_TLS: u32 = 0;
pub const configUSE_C_RUNTIME_TLS_SUPPORT: u32 = 0;
pub const INCLUDE_xTaskDelayUntil: u32 = 1;
pub const INCLUDE_xQueueGetMutexHolder: u32 = 0;
pub const INCLUDE_xSemaphoreGetMutexHolder: u32 = 0;
pub const INCLUDE_uxTaskGetStackHighWaterMark2: u32 = 0;
pub const configUSE_ALTERNATIVE_API: u32 = 0;
pub const portCRITICAL_NESTING_IN_TCB: u32 = 0;
pub const configPRECONDITION_DEFINED: u32 = 0;
pub const portHAS_NESTED_INTERRUPTS: u32 = 1;
pub const configRECORD_STACK_HIGH_ADDRESS: u32 = 0;
pub const configINCLUDE_FREERTOS_TASK_C_ADDITIONS_H: u32 = 0;
pub const configEXPECTED_IDLE_TIME_BEFORE_SLEEP: u32 = 2;
pub const configINITIAL_TICK_COUNT: u32 = 0;
pub const configUSE_TASK_FPU_SUPPORT: u32 = 1;
pub const configRUN_ADDITIONAL_TESTS: u32 = 0;
pub const configENABLE_PAC: u32 = 0;
pub const configENABLE_BTI: u32 = 0;
pub const tskKERNEL_VERSION_NUMBER: &[u8; 9] = b"V11.1.0+\0";
pub const tskKERNEL_VERSION_MAJOR: u32 = 11;
pub const tskKERNEL_VERSION_MINOR: u32 = 1;
pub const tskKERNEL_VERSION_BUILD: u32 = 0;
pub const tskMPU_REGION_READ_ONLY: u32 = 1;
pub const tskMPU_REGION_READ_WRITE: u32 = 2;
pub const tskMPU_REGION_EXECUTE_NEVER: u32 = 4;
pub const tskMPU_REGION_NORMAL_MEMORY: u32 = 8;
pub const tskMPU_REGION_DEVICE_MEMORY: u32 = 16;
pub const tskMPU_READ_PERMISSION: u32 = 1;
pub const tskMPU_WRITE_PERMISSION: u32 = 2;
pub const tskDEFAULT_INDEX_TO_NOTIFY: u32 = 0;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type TaskFunction_t =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
pub type StackType_t = usize;
pub type BaseType_t = ::std::os::raw::c_long;
pub type UBaseType_t = u64;
pub type TickType_t = u64;
unsafe extern "C" {
    pub fn vPortEnterCritical();
}
unsafe extern "C" {
    pub fn vPortExitCritical();
}
unsafe extern "C" {
    pub fn uxPortSetInterruptMask() -> UBaseType_t;
}
unsafe extern "C" {
    pub fn vPortClearInterruptMask(uxNewMaskValue: UBaseType_t);
}
unsafe extern "C" {
    pub fn vPortInstallFreeRTOSVectorTable();
}
unsafe extern "C" {
    pub fn FreeRTOS_Tick_Handler();
}
unsafe extern "C" {
    pub fn vPortTaskUsesFPU();
}
unsafe extern "C" {
    pub fn vPortValidateInterruptPriority();
}
unsafe extern "C" {
    pub fn pxPortInitialiseStack(
        pxTopOfStack: *mut StackType_t,
        pxCode: TaskFunction_t,
        pvParameters: *mut ::std::os::raw::c_void,
    ) -> *mut StackType_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HeapRegion {
    pub pucStartAddress: *mut u8,
    pub xSizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HeapRegion"][::std::mem::size_of::<HeapRegion>() - 16usize];
    ["Alignment of HeapRegion"][::std::mem::align_of::<HeapRegion>() - 8usize];
    ["Offset of field: HeapRegion::pucStartAddress"]
        [::std::mem::offset_of!(HeapRegion, pucStartAddress) - 0usize];
    ["Offset of field: HeapRegion::xSizeInBytes"]
        [::std::mem::offset_of!(HeapRegion, xSizeInBytes) - 8usize];
};
pub type HeapRegion_t = HeapRegion;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xHeapStats {
    pub xAvailableHeapSpaceInBytes: usize,
    pub xSizeOfLargestFreeBlockInBytes: usize,
    pub xSizeOfSmallestFreeBlockInBytes: usize,
    pub xNumberOfFreeBlocks: usize,
    pub xMinimumEverFreeBytesRemaining: usize,
    pub xNumberOfSuccessfulAllocations: usize,
    pub xNumberOfSuccessfulFrees: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xHeapStats"][::std::mem::size_of::<xHeapStats>() - 56usize];
    ["Alignment of xHeapStats"][::std::mem::align_of::<xHeapStats>() - 8usize];
    ["Offset of field: xHeapStats::xAvailableHeapSpaceInBytes"]
        [::std::mem::offset_of!(xHeapStats, xAvailableHeapSpaceInBytes) - 0usize];
    ["Offset of field: xHeapStats::xSizeOfLargestFreeBlockInBytes"]
        [::std::mem::offset_of!(xHeapStats, xSizeOfLargestFreeBlockInBytes) - 8usize];
    ["Offset of field: xHeapStats::xSizeOfSmallestFreeBlockInBytes"]
        [::std::mem::offset_of!(xHeapStats, xSizeOfSmallestFreeBlockInBytes) - 16usize];
    ["Offset of field: xHeapStats::xNumberOfFreeBlocks"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfFreeBlocks) - 24usize];
    ["Offset of field: xHeapStats::xMinimumEverFreeBytesRemaining"]
        [::std::mem::offset_of!(xHeapStats, xMinimumEverFreeBytesRemaining) - 32usize];
    ["Offset of field: xHeapStats::xNumberOfSuccessfulAllocations"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfSuccessfulAllocations) - 40usize];
    ["Offset of field: xHeapStats::xNumberOfSuccessfulFrees"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfSuccessfulFrees) - 48usize];
};
pub type HeapStats_t = xHeapStats;
unsafe extern "C" {
    pub fn vPortDefineHeapRegions(pxHeapRegions: *const HeapRegion_t);
}
unsafe extern "C" {
    pub fn vPortGetHeapStats(pxHeapStats: *mut HeapStats_t);
}
unsafe extern "C" {
    pub fn pvPortMalloc(xWantedSize: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn pvPortCalloc(xNum: usize, xSize: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn vPortFree(pv: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn vPortInitialiseBlocks();
}
unsafe extern "C" {
    pub fn xPortGetFreeHeapSize() -> usize;
}
unsafe extern "C" {
    pub fn xPortGetMinimumEverFreeHeapSize() -> usize;
}
unsafe extern "C" {
    pub fn xPortResetHeapMinimumEverFreeHeapSize();
}
unsafe extern "C" {
    pub fn vPortHeapResetState();
}
unsafe extern "C" {
    pub fn xPortStartScheduler() -> BaseType_t;
}
unsafe extern "C" {
    pub fn vPortEndScheduler();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_LIST_ITEM"][::std::mem::size_of::<xSTATIC_LIST_ITEM>() - 40usize];
    ["Alignment of xSTATIC_LIST_ITEM"][::std::mem::align_of::<xSTATIC_LIST_ITEM>() - 8usize];
    ["Offset of field: xSTATIC_LIST_ITEM::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_LIST_ITEM, xDummy2) - 0usize];
    ["Offset of field: xSTATIC_LIST_ITEM::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_LIST_ITEM, pvDummy3) - 8usize];
};
pub type StaticListItem_t = xSTATIC_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_MINI_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut ::std::os::raw::c_void; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_MINI_LIST_ITEM"][::std::mem::size_of::<xSTATIC_MINI_LIST_ITEM>() - 24usize];
    ["Alignment of xSTATIC_MINI_LIST_ITEM"]
        [::std::mem::align_of::<xSTATIC_MINI_LIST_ITEM>() - 8usize];
    ["Offset of field: xSTATIC_MINI_LIST_ITEM::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_MINI_LIST_ITEM, xDummy2) - 0usize];
    ["Offset of field: xSTATIC_MINI_LIST_ITEM::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_MINI_LIST_ITEM, pvDummy3) - 8usize];
};
pub type StaticMiniListItem_t = xSTATIC_MINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST {
    pub uxDummy2: UBaseType_t,
    pub pvDummy3: *mut ::std::os::raw::c_void,
    pub xDummy4: StaticMiniListItem_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_LIST"][::std::mem::size_of::<xSTATIC_LIST>() - 40usize];
    ["Alignment of xSTATIC_LIST"][::std::mem::align_of::<xSTATIC_LIST>() - 8usize];
    ["Offset of field: xSTATIC_LIST::uxDummy2"]
        [::std::mem::offset_of!(xSTATIC_LIST, uxDummy2) - 0usize];
    ["Offset of field: xSTATIC_LIST::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_LIST, pvDummy3) - 8usize];
    ["Offset of field: xSTATIC_LIST::xDummy4"]
        [::std::mem::offset_of!(xSTATIC_LIST, xDummy4) - 16usize];
};
pub type StaticList_t = xSTATIC_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TCB {
    pub pxDummy1: *mut ::std::os::raw::c_void,
    pub xDummy3: [StaticListItem_t; 2usize],
    pub uxDummy5: UBaseType_t,
    pub pxDummy6: *mut ::std::os::raw::c_void,
    pub ucDummy7: [u8; 16usize],
    pub uxDummy12: [UBaseType_t; 2usize],
    pub ulDummy18: [u32; 1usize],
    pub ucDummy19: [u8; 1usize],
    pub uxDummy20: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_TCB"][::std::mem::size_of::<xSTATIC_TCB>() - 144usize];
    ["Alignment of xSTATIC_TCB"][::std::mem::align_of::<xSTATIC_TCB>() - 8usize];
    ["Offset of field: xSTATIC_TCB::pxDummy1"]
        [::std::mem::offset_of!(xSTATIC_TCB, pxDummy1) - 0usize];
    ["Offset of field: xSTATIC_TCB::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_TCB, xDummy3) - 8usize];
    ["Offset of field: xSTATIC_TCB::uxDummy5"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy5) - 88usize];
    ["Offset of field: xSTATIC_TCB::pxDummy6"]
        [::std::mem::offset_of!(xSTATIC_TCB, pxDummy6) - 96usize];
    ["Offset of field: xSTATIC_TCB::ucDummy7"]
        [::std::mem::offset_of!(xSTATIC_TCB, ucDummy7) - 104usize];
    ["Offset of field: xSTATIC_TCB::uxDummy12"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy12) - 120usize];
    ["Offset of field: xSTATIC_TCB::ulDummy18"]
        [::std::mem::offset_of!(xSTATIC_TCB, ulDummy18) - 136usize];
    ["Offset of field: xSTATIC_TCB::ucDummy19"]
        [::std::mem::offset_of!(xSTATIC_TCB, ucDummy19) - 140usize];
    ["Offset of field: xSTATIC_TCB::uxDummy20"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy20) - 141usize];
};
pub type StaticTask_t = xSTATIC_TCB;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xSTATIC_QUEUE {
    pub pvDummy1: [*mut ::std::os::raw::c_void; 3usize],
    pub u: xSTATIC_QUEUE__bindgen_ty_1,
    pub xDummy3: [StaticList_t; 2usize],
    pub uxDummy4: [UBaseType_t; 3usize],
    pub ucDummy5: [u8; 2usize],
    pub ucDummy6: u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xSTATIC_QUEUE__bindgen_ty_1 {
    pub pvDummy2: *mut ::std::os::raw::c_void,
    pub uxDummy2: UBaseType_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_QUEUE__bindgen_ty_1"]
        [::std::mem::size_of::<xSTATIC_QUEUE__bindgen_ty_1>() - 8usize];
    ["Alignment of xSTATIC_QUEUE__bindgen_ty_1"]
        [::std::mem::align_of::<xSTATIC_QUEUE__bindgen_ty_1>() - 8usize];
    ["Offset of field: xSTATIC_QUEUE__bindgen_ty_1::pvDummy2"]
        [::std::mem::offset_of!(xSTATIC_QUEUE__bindgen_ty_1, pvDummy2) - 0usize];
    ["Offset of field: xSTATIC_QUEUE__bindgen_ty_1::uxDummy2"]
        [::std::mem::offset_of!(xSTATIC_QUEUE__bindgen_ty_1, uxDummy2) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_QUEUE"][::std::mem::size_of::<xSTATIC_QUEUE>() - 144usize];
    ["Alignment of xSTATIC_QUEUE"][::std::mem::align_of::<xSTATIC_QUEUE>() - 8usize];
    ["Offset of field: xSTATIC_QUEUE::pvDummy1"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, pvDummy1) - 0usize];
    ["Offset of field: xSTATIC_QUEUE::u"][::std::mem::offset_of!(xSTATIC_QUEUE, u) - 24usize];
    ["Offset of field: xSTATIC_QUEUE::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, xDummy3) - 32usize];
    ["Offset of field: xSTATIC_QUEUE::uxDummy4"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, uxDummy4) - 112usize];
    ["Offset of field: xSTATIC_QUEUE::ucDummy5"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, ucDummy5) - 136usize];
    ["Offset of field: xSTATIC_QUEUE::ucDummy6"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, ucDummy6) - 138usize];
};
pub type StaticQueue_t = xSTATIC_QUEUE;
pub type StaticSemaphore_t = StaticQueue_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_EVENT_GROUP {
    pub xDummy1: TickType_t,
    pub xDummy2: StaticList_t,
    pub ucDummy4: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_EVENT_GROUP"][::std::mem::size_of::<xSTATIC_EVENT_GROUP>() - 56usize];
    ["Alignment of xSTATIC_EVENT_GROUP"][::std::mem::align_of::<xSTATIC_EVENT_GROUP>() - 8usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::xDummy1"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, xDummy1) - 0usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, xDummy2) - 8usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::ucDummy4"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, ucDummy4) - 48usize];
};
pub type StaticEventGroup_t = xSTATIC_EVENT_GROUP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TIMER {
    pub pvDummy1: *mut ::std::os::raw::c_void,
    pub xDummy2: StaticListItem_t,
    pub xDummy3: TickType_t,
    pub pvDummy5: *mut ::std::os::raw::c_void,
    pub pvDummy6: TaskFunction_t,
    pub ucDummy8: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_TIMER"][::std::mem::size_of::<xSTATIC_TIMER>() - 80usize];
    ["Alignment of xSTATIC_TIMER"][::std::mem::align_of::<xSTATIC_TIMER>() - 8usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy1"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy1) - 0usize];
    ["Offset of field: xSTATIC_TIMER::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_TIMER, xDummy2) - 8usize];
    ["Offset of field: xSTATIC_TIMER::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_TIMER, xDummy3) - 48usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy5"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy5) - 56usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy6"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy6) - 64usize];
    ["Offset of field: xSTATIC_TIMER::ucDummy8"]
        [::std::mem::offset_of!(xSTATIC_TIMER, ucDummy8) - 72usize];
};
pub type StaticTimer_t = xSTATIC_TIMER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_STREAM_BUFFER {
    pub uxDummy1: [usize; 4usize],
    pub pvDummy2: [*mut ::std::os::raw::c_void; 3usize],
    pub ucDummy3: u8,
    pub uxDummy6: UBaseType_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_STREAM_BUFFER"][::std::mem::size_of::<xSTATIC_STREAM_BUFFER>() - 72usize];
    ["Alignment of xSTATIC_STREAM_BUFFER"]
        [::std::mem::align_of::<xSTATIC_STREAM_BUFFER>() - 8usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::uxDummy1"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, uxDummy1) - 0usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::pvDummy2"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, pvDummy2) - 32usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::ucDummy3"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, ucDummy3) - 56usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::uxDummy6"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, uxDummy6) - 64usize];
};
pub type StaticStreamBuffer_t = xSTATIC_STREAM_BUFFER;
pub type StaticMessageBuffer_t = StaticStreamBuffer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST_ITEM {
    #[doc = "< The value being listed.  In most cases this is used to sort the list in ascending order."]
    pub xItemValue: TickType_t,
    #[doc = "< Pointer to the next ListItem_t in the list."]
    pub pxNext: *mut xLIST_ITEM,
    #[doc = "< Pointer to the previous ListItem_t in the list."]
    pub pxPrevious: *mut xLIST_ITEM,
    #[doc = "< Pointer to the object (normally a TCB) that contains the list item.  There is therefore a two way link between the object containing the list item and the list item itself."]
    pub pvOwner: *mut ::std::os::raw::c_void,
    #[doc = "< Pointer to the list in which this list item is placed (if any)."]
    pub pxContainer: *mut xLIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xLIST_ITEM"][::std::mem::size_of::<xLIST_ITEM>() - 40usize];
    ["Alignment of xLIST_ITEM"][::std::mem::align_of::<xLIST_ITEM>() - 8usize];
    ["Offset of field: xLIST_ITEM::xItemValue"]
        [::std::mem::offset_of!(xLIST_ITEM, xItemValue) - 0usize];
    ["Offset of field: xLIST_ITEM::pxNext"][::std::mem::offset_of!(xLIST_ITEM, pxNext) - 8usize];
    ["Offset of field: xLIST_ITEM::pxPrevious"]
        [::std::mem::offset_of!(xLIST_ITEM, pxPrevious) - 16usize];
    ["Offset of field: xLIST_ITEM::pvOwner"][::std::mem::offset_of!(xLIST_ITEM, pvOwner) - 24usize];
    ["Offset of field: xLIST_ITEM::pxContainer"]
        [::std::mem::offset_of!(xLIST_ITEM, pxContainer) - 32usize];
};
pub type ListItem_t = xLIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMINI_LIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xMINI_LIST_ITEM"][::std::mem::size_of::<xMINI_LIST_ITEM>() - 24usize];
    ["Alignment of xMINI_LIST_ITEM"][::std::mem::align_of::<xMINI_LIST_ITEM>() - 8usize];
    ["Offset of field: xMINI_LIST_ITEM::xItemValue"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, xItemValue) - 0usize];
    ["Offset of field: xMINI_LIST_ITEM::pxNext"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, pxNext) - 8usize];
    ["Offset of field: xMINI_LIST_ITEM::pxPrevious"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, pxPrevious) - 16usize];
};
pub type MiniListItem_t = xMINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST {
    pub uxNumberOfItems: UBaseType_t,
    #[doc = "< Used to walk through the list.  Points to the last item returned by a call to listGET_OWNER_OF_NEXT_ENTRY ()."]
    pub pxIndex: *mut ListItem_t,
    #[doc = "< List item that contains the maximum possible item value meaning it is always at the end of the list and is therefore used as a marker."]
    pub xListEnd: MiniListItem_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xLIST"][::std::mem::size_of::<xLIST>() - 40usize];
    ["Alignment of xLIST"][::std::mem::align_of::<xLIST>() - 8usize];
    ["Offset of field: xLIST::uxNumberOfItems"]
        [::std::mem::offset_of!(xLIST, uxNumberOfItems) - 0usize];
    ["Offset of field: xLIST::pxIndex"][::std::mem::offset_of!(xLIST, pxIndex) - 8usize];
    ["Offset of field: xLIST::xListEnd"][::std::mem::offset_of!(xLIST, xListEnd) - 16usize];
};
pub type List_t = xLIST;
unsafe extern "C" {
    pub fn vListInitialise(pxList: *mut List_t);
}
unsafe extern "C" {
    pub fn vListInitialiseItem(pxItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn vListInsert(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn vListInsertEnd(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn uxListRemove(pxItemToRemove: *mut ListItem_t) -> UBaseType_t;
}
#[doc = " task. h\n\n Type by which tasks are referenced.  For example, a call to xTaskCreate\n returns (via a pointer parameter) an TaskHandle_t variable that can then\n be used as a parameter to vTaskDelete to delete the task.\n\n \\defgroup TaskHandle_t TaskHandle_t\n \\ingroup Tasks"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tskTaskControlBlock {
    _unused: [u8; 0],
}
pub type TaskHandle_t = *mut tskTaskControlBlock;
pub type ConstTaskHandle_t = *const tskTaskControlBlock;
pub type TaskHookFunction_t =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void) -> BaseType_t>;
pub const eTaskState_eRunning: eTaskState = 0;
pub const eTaskState_eReady: eTaskState = 1;
pub const eTaskState_eBlocked: eTaskState = 2;
pub const eTaskState_eSuspended: eTaskState = 3;
pub const eTaskState_eDeleted: eTaskState = 4;
pub const eTaskState_eInvalid: eTaskState = 5;
pub type eTaskState = ::std::os::raw::c_uint;
pub const eNotifyAction_eNoAction: eNotifyAction = 0;
pub const eNotifyAction_eSetBits: eNotifyAction = 1;
pub const eNotifyAction_eIncrement: eNotifyAction = 2;
pub const eNotifyAction_eSetValueWithOverwrite: eNotifyAction = 3;
pub const eNotifyAction_eSetValueWithoutOverwrite: eNotifyAction = 4;
pub type eNotifyAction = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTIME_OUT {
    pub xOverflowCount: BaseType_t,
    pub xTimeOnEntering: TickType_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTIME_OUT"][::std::mem::size_of::<xTIME_OUT>() - 16usize];
    ["Alignment of xTIME_OUT"][::std::mem::align_of::<xTIME_OUT>() - 8usize];
    ["Offset of field: xTIME_OUT::xOverflowCount"]
        [::std::mem::offset_of!(xTIME_OUT, xOverflowCount) - 0usize];
    ["Offset of field: xTIME_OUT::xTimeOnEntering"]
        [::std::mem::offset_of!(xTIME_OUT, xTimeOnEntering) - 8usize];
};
pub type TimeOut_t = xTIME_OUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMEMORY_REGION {
    pub pvBaseAddress: *mut ::std::os::raw::c_void,
    pub ulLengthInBytes: u32,
    pub ulParameters: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xMEMORY_REGION"][::std::mem::size_of::<xMEMORY_REGION>() - 16usize];
    ["Alignment of xMEMORY_REGION"][::std::mem::align_of::<xMEMORY_REGION>() - 8usize];
    ["Offset of field: xMEMORY_REGION::pvBaseAddress"]
        [::std::mem::offset_of!(xMEMORY_REGION, pvBaseAddress) - 0usize];
    ["Offset of field: xMEMORY_REGION::ulLengthInBytes"]
        [::std::mem::offset_of!(xMEMORY_REGION, ulLengthInBytes) - 8usize];
    ["Offset of field: xMEMORY_REGION::ulParameters"]
        [::std::mem::offset_of!(xMEMORY_REGION, ulParameters) - 12usize];
};
pub type MemoryRegion_t = xMEMORY_REGION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_PARAMETERS {
    pub pvTaskCode: TaskFunction_t,
    pub pcName: *const ::std::os::raw::c_char,
    pub usStackDepth: usize,
    pub pvParameters: *mut ::std::os::raw::c_void,
    pub uxPriority: UBaseType_t,
    pub puxStackBuffer: *mut StackType_t,
    pub xRegions: [MemoryRegion_t; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTASK_PARAMETERS"][::std::mem::size_of::<xTASK_PARAMETERS>() - 64usize];
    ["Alignment of xTASK_PARAMETERS"][::std::mem::align_of::<xTASK_PARAMETERS>() - 8usize];
    ["Offset of field: xTASK_PARAMETERS::pvTaskCode"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pvTaskCode) - 0usize];
    ["Offset of field: xTASK_PARAMETERS::pcName"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pcName) - 8usize];
    ["Offset of field: xTASK_PARAMETERS::usStackDepth"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, usStackDepth) - 16usize];
    ["Offset of field: xTASK_PARAMETERS::pvParameters"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pvParameters) - 24usize];
    ["Offset of field: xTASK_PARAMETERS::uxPriority"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, uxPriority) - 32usize];
    ["Offset of field: xTASK_PARAMETERS::puxStackBuffer"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, puxStackBuffer) - 40usize];
    ["Offset of field: xTASK_PARAMETERS::xRegions"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, xRegions) - 48usize];
};
pub type TaskParameters_t = xTASK_PARAMETERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_STATUS {
    pub xHandle: TaskHandle_t,
    pub pcTaskName: *const ::std::os::raw::c_char,
    pub xTaskNumber: UBaseType_t,
    pub eCurrentState: eTaskState,
    pub uxCurrentPriority: UBaseType_t,
    pub uxBasePriority: UBaseType_t,
    pub ulRunTimeCounter: u32,
    pub pxStackBase: *mut StackType_t,
    pub usStackHighWaterMark: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTASK_STATUS"][::std::mem::size_of::<xTASK_STATUS>() - 72usize];
    ["Alignment of xTASK_STATUS"][::std::mem::align_of::<xTASK_STATUS>() - 8usize];
    ["Offset of field: xTASK_STATUS::xHandle"]
        [::std::mem::offset_of!(xTASK_STATUS, xHandle) - 0usize];
    ["Offset of field: xTASK_STATUS::pcTaskName"]
        [::std::mem::offset_of!(xTASK_STATUS, pcTaskName) - 8usize];
    ["Offset of field: xTASK_STATUS::xTaskNumber"]
        [::std::mem::offset_of!(xTASK_STATUS, xTaskNumber) - 16usize];
    ["Offset of field: xTASK_STATUS::eCurrentState"]
        [::std::mem::offset_of!(xTASK_STATUS, eCurrentState) - 24usize];
    ["Offset of field: xTASK_STATUS::uxCurrentPriority"]
        [::std::mem::offset_of!(xTASK_STATUS, uxCurrentPriority) - 32usize];
    ["Offset of field: xTASK_STATUS::uxBasePriority"]
        [::std::mem::offset_of!(xTASK_STATUS, uxBasePriority) - 40usize];
    ["Offset of field: xTASK_STATUS::ulRunTimeCounter"]
        [::std::mem::offset_of!(xTASK_STATUS, ulRunTimeCounter) - 48usize];
    ["Offset of field: xTASK_STATUS::pxStackBase"]
        [::std::mem::offset_of!(xTASK_STATUS, pxStackBase) - 56usize];
    ["Offset of field: xTASK_STATUS::usStackHighWaterMark"]
        [::std::mem::offset_of!(xTASK_STATUS, usStackHighWaterMark) - 64usize];
};
pub type TaskStatus_t = xTASK_STATUS;
pub const eSleepModeStatus_eAbortSleep: eSleepModeStatus = 0;
pub const eSleepModeStatus_eStandardSleep: eSleepModeStatus = 1;
pub const eSleepModeStatus_eNoTasksWaitingTimeout: eSleepModeStatus = 2;
pub type eSleepModeStatus = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn xTaskCreate(
        pxTaskCode: TaskFunction_t,
        pcName: *const ::std::os::raw::c_char,
        uxStackDepth: usize,
        pvParameters: *mut ::std::os::raw::c_void,
        uxPriority: UBaseType_t,
        pxCreatedTask: *mut TaskHandle_t,
    ) -> BaseType_t;
}
unsafe extern "C" {
    pub fn xTaskCreateStatic(
        pxTaskCode: TaskFunction_t,
        pcName: *const ::std::os::raw::c_char,
        uxStackDepth: usize,
        pvParameters: *mut ::std::os::raw::c_void,
        uxPriority: UBaseType_t,
